import json

text = {'info': {
    'Шифровка файла': "Шифрует файл, находящийся\nв указанной директории.",
    'Шифр Виженера': "Ключом является слово или буква на английском(по умолчанию A). Поддерживает только английский алфавит.",
    'Шифр Цезаря': "Ключом является одно целое число (по умолчанию 1).Поддерживает только английский алфавит.",
    'Азбука Морзе': 'Ключ не требуется. Поддерживает только английский алфавит и цифры без пробелов.',
    'Шифр замены': 'Ключ не требуется. Поддерживает только английский алфавит',
    "Омофонический шифр": "Ключ не требуется. Поддерживает только английский алфавит.",
    "Шифрование Гронсвельда": 'Ключом является число. Поддерживает только английский алфавит.',
    "Псевдосимвольное шифрование": "Ключ не требуется. Поддерживает только английский алфавит.",
    "Бинарный код": "Ключ не требуется."},
        "Morze": {'A': '.-', 'B': '-...', 'C': '-.-.',
                  'D': '-..', 'E': '.', 'F': '..-.',
                  'G': '--.', 'H': '....', 'I': '..',
                  'J': '.---', 'K': '-.-', 'L': '.-..',
                  'M': '--', 'N': '-.', 'O': '---',
                  'P': '.--.', 'Q': '--.-', 'R': '.-.',
                  'S': '...', 'T': '-', 'U': '..-',
                  'V': '...-', 'W': '.--', 'X': '-..-',
                  'Y': '-.--', 'Z': '--..',

                  '0': '-----', '1': '.----', '2': '..---',
                  '3': '...--', '4': '....-', '5': '.....',
                  '6': '-....', '7': '--...', '8': '---..',
                  '9': '----.'
                  }, "Omofon_keys": {
        'A': ['Q', '1', '!', '`', 'Я', 'М', 'Ь', 'З'],
        'B': ['W', '2'],
        'C': ['E', '3', '@'],
        'D': ['R', '4', '#', ':'],
        'E': ['T', '5', '$', ';', 'Ц', 'Е', 'Ш', 'Ж', ',', 'ф', 'ч', 'ш'],
        'F': ['Y', '6'],
        'G': ['U', '7'],
        'H': ['I', '8', '%', '"', 'Ы', 'П'],
        'I': ['O', '9', '^', '/', 'Ч', 'И'],
        'J': ['P'],
        'K': ['A'],
        'L': ['S', '0', '&', '?'],
        'M': ['D', '*'],
        'N': ['F', '(', '<', 'У', 'Н', 'Л'],
        'O': ['G', ')', '>', 'В', 'Р', 'Б', 'Х'],
        'P': ['H', '-'],
        'Q': ['J'],
        'R': ['K', '_', '|', 'С', 'Т', 'Щ'],
        'S': ['L', '+', '№', 'К', 'Г', 'Д'],
        'T': ['M', '=', 'Й', 'А', 'О', 'Ю', 'Ъ', '.', 'й'],
        'U': ['N', '[', 'Ф'],
        'V': ['B'],
        'W': ['V', ']'],
        'X': ['C'],
        'Y': ['X', '{'],
        'Z': ['Z'],
        ' ': ['}']}, 'Pseudosim_keys': {
        'A': "AAA", 'B': "AAА", 'C': "AAΑ",
        'D': "AАA", 'E': "AАА", 'F': "AАΑ",
        'G': "AΑA", 'H': "AΑА", 'I': "AΑΑ",
        'J': "АAA", 'K': "АAА", 'L': "АAΑ",
        'M': "ААA", 'N': "ААА", 'O': "ААΑ",
        'P': "АΑA", 'Q': "АΑА", 'R': "АΑΑ",
        'S': "ΑAA", 'T': "ΑAА", 'U': "ΑAΑ",
        'V': "ΑАA", 'W': "ΑАА", 'X': "ΑАΑ",
        'Y': "ΑΑA", 'Z': "ΑΑА", ' ': "ΑΑΑ"
    }, 'Replaces_keys': {
        'A': '!', 'B': '@', 'C': '#',
        'D': '$', 'E': '%', 'F': '^',
        'G': '&', 'H': '*', 'I': '(',
        'J': ')', 'K': '-', 'L': '=',
        'M': '+', 'N': '?', 'O': ':',
        'P': ';', 'Q': '<', 'R': '>',
        'S': '/', 'T': '[', 'U': ']',
        'V': '{', 'W': '}', 'X': '|',
        'Y': '.', 'Z': ',', ' ': '~'
    }}
with open('import_info.json', 'w', encoding='utf-8') as f_obj:
    json.dump(text, f_obj, ensure_ascii=False)
with open('import_info.json', 'r', encoding='utf-8') as f_obj:
    a = json.load(f_obj)
